Jason2866/Tasmota/sdkconfig.defaults
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4
CONFIG_BT_NIMBLE_HS_FLOW_CTRL=y
CONFIG_BT_NIMBLE_HS_FLOW_CTRL_ITVL=1000
CONFIG_BT_NIMBLE_HS_FLOW_CTRL_THRESH=2
CONFIG_BT_NIMBLE_HS_FLOW_CTRL_TX_ON_DISCONNECT=y
CONFIG_BT_NIMBLE_RPA_TIMEOUT=900
# CONFIG_BT_NIMBLE_MESH is not set
# CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS is not set
CONFIG_BT_NIMBLE_HS_STOP_TIMEOUT_MS=2000
# CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY is not set
# CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT is not set
CONFIG_BT_NIMBLE_WHITELIST_SIZE=12
# CONFIG_BT_NIMBLE_TEST_THROUGHPUT_TEST is not set
# CONFIG_BT_NIMBLE_BLUFI_ENABLE is not set
CONFIG_BT_NIMBLE_USE_ESP_TIMER=y
CONFIG_BT_NIMBLE_LEGACY_VHCI_ENABLE=y
# CONFIG_BT_NIMBLE_BLE_GATT_BLOB_TRANSFER is not set

#
# GAP Service
#

#
# GAP Appearance write permissions
#
# CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE is not set
# end of GAP Appearance write permissions

CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM=0
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ENC=0
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ATHN=0
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ATHR=0
CONFIG_BT_NIMBLE_SVC_GAP_CAR_CHAR_NOT_SUPP=y
# CONFIG_BT_NIMBLE_SVC_GAP_CAR_NOT_SUPP is not set
# CONFIG_BT_NIMBLE_SVC_GAP_CAR_SUPP is not set
CONFIG_BT_NIMBLE_SVC_GAP_CENT_ADDR_RESOLUTION=-1

#
# GAP device name write permissions
#
# CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE is not set
# end of GAP device name write permissions

CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM=0
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_ENC=0
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_AUTHEN=0
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_AUTHOR=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=0
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=0
# end of GAP Service

#
# BLE Services
#
# CONFIG_BT_NIMBLE_HID_SERVICE is not set
# end of BLE Services

# CONFIG_BT_NIMBLE_VS_SUPPORT is not set
# CONFIG_BT_NIMBLE_ENC_ADV_DATA is not set
# CONFIG_BT_NIMBLE_HIGH_DUTY_ADV_ITVL is not set
# CONFIG_BT_NIMBLE_HOST_ALLOW_CONNECT_WITH_SCAN is not set
# CONFIG_BT_NIMBLE_HOST_QUEUE_CONG_CHECK is not set

#
# Host-controller Transport
#
CONFIG_UART_HW_FLOWCTRL_DISABLE=y
# CONFIG_UART_HW_FLOWCTRL_CTS_RTS is not set
CONFIG_BT_NIMBLE_HCI_UART_FLOW_CTRL=0
CONFIG_BT_NIMBLE_HCI_UART_RTS_PIN=19
CONFIG_BT_NIMBLE_HCI_UART_CTS_PIN=23
# end of Host-controller Transport
# end of NimBLE Options

#
# Controller Options
#

#
# MODEM SLEEP Options
#
# end of MODEM SLEEP Options

# end of Controller Options

#
# Common Options
#
# end of Common Options

# end of Bluetooth


#
# Console Library
#
# end of Console Library

#
# Driver Configurations
#

#
# TWAI Configuration
#
# end of TWAI Configuration

#
# Legacy ADC Driver Configuration
#

#
# Legacy ADC Calibration Configuration
#
# end of Legacy ADC Calibration Configuration
# end of Legacy ADC Driver Configuration

#
# Legacy DAC Driver Configurations
#
# end of Legacy DAC Driver Configurations

#
# Legacy MCPWM Driver Configurations
#
# end of Legacy MCPWM Driver Configurations

#
# Legacy Timer Group Driver Configurations
#
# end of Legacy Timer Group Driver Configurations

#
# Legacy RMT Driver Configurations
#
# end of Legacy RMT Driver Configurations

#
# Legacy I2S Driver Configurations
#
# end of Legacy I2S Driver Configurations

#
# Legacy PCNT Driver Configurations
#
# end of Legacy PCNT Driver Configurations

#
# Legacy SDM Driver Configurations
#
# end of Legacy SDM Driver Configurations
# end of Driver Configurations

#
# eFuse Bit Manager
#
# end of eFuse Bit Manager

#
# ESP-TLS
#
# end of ESP-TLS

#
# ADC and ADC Calibration
#

#
# ADC Calibration Configurations
#
# end of ADC Calibration Configurations

# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
# end of Wireless Coexistence

#
# Common ESP-related
#
# end of Common ESP-related

#
# ESP-Driver:DAC Configurations
#
# end of ESP-Driver:DAC Configurations

#
# ESP-Driver:GPIO Configurations
#
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:GPTimer Configurations
#
# end of ESP-Driver:GPTimer Configurations

#
# ESP-Driver:I2C Configurations
#
# end of ESP-Driver:I2C Configurations

#
# ESP-Driver:I2S Configurations
#
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:LEDC Configurations
#
# end of ESP-Driver:LEDC Configurations

#
# ESP-Driver:MCPWM Configurations
#
# end of ESP-Driver:MCPWM Configurations

#
# ESP-Driver:PCNT Configurations
#
# end of ESP-Driver:PCNT Configurations

#
# ESP-Driver:RMT Configurations
#
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:Sigma Delta Modulator Configurations
#
# end of ESP-Driver:Sigma Delta Modulator Configurations

#
# ESP-Driver:SPI Configurations
#
# end of ESP-Driver:SPI Configurations

#
# ESP-Driver:Touch Sensor Configurations
#
# end of ESP-Driver:Touch Sensor Configurations

#
# ESP-Driver:UART Configurations
#
# end of ESP-Driver:UART Configurations

#
# Ethernet
#
# end of Ethernet

#
# Event Loop Library
#
# end of Event Loop Library

#
# GDB Stub
#
# end of GDB Stub

#
# ESP HTTP client
#
# end of ESP HTTP client

#
# HTTP Server
#
# end of HTTP Server

#
# ESP HTTPS OTA
#
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# end of ESP HTTPS server

#
# Hardware Settings
#

#
# Chip revision
#

#
# Maximum Supported ESP32 Revision (Rev v3.99)
#
# end of Chip revision

#
# MAC Config
#
# end of MAC Config

#
# Sleep Config
#
# end of Sleep Config

#
# RTC Clock Config
#
# end of RTC Clock Config

#
# Peripheral Control
#
# end of Peripheral Control

#
# Main XTAL Config
#
# end of Main XTAL Config
# end of Hardware Settings

#
# LCD and Touch Panel
#

#
# LCD Touch Drivers are maintained in the IDF Component Registry
#

#
# LCD Peripheral Configuration
#
# end of LCD Peripheral Configuration
# end of LCD and Touch Panel

#
# ESP NETIF Adapter
#
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# end of PHY

#
# Power Management
#
# end of Power Management

#
# ESP PSRAM
#

#
# SPI RAM config
#

#
# SPIRAM cache workaround debugging
#
# end of SPIRAM cache workaround debugging

#
# SPIRAM workaround libraries placement
#
# end of SPIRAM workaround libraries placement


#
# PSRAM clock and cs IO for ESP32-DOWD
#
# end of PSRAM clock and cs IO for ESP32-DOWD

#
# PSRAM clock and cs IO for ESP32-D2WD
#
# end of PSRAM clock and cs IO for ESP32-D2WD

#
# PSRAM clock and cs IO for ESP32-PICO-D4
#
# end of PSRAM clock and cs IO for ESP32-PICO-D4

# end of SPI RAM config
# end of ESP PSRAM

#
# ESP Ringbuf
#
# CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH is not set
# end of ESP Ringbuf

#
# ESP System Settings
#

#
# Memory
#

#
# Non-backward compatible options
#
# end of Non-backward compatible options
# end of Memory

#
# Trace memory
#
# end of Trace memory


#
# Memory protection
#
# end of Memory protection


#
# Brownout Detector
#
# end of Brownout Detector

# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# end of ESP Timer (High Resolution Timer)

#
# Wi-Fi
#

#
# WPS Configuration Options
#
# end of WPS Configuration Options

# end of Wi-Fi

#
# Core dump
#
# end of Core dump

#
# FAT Filesystem support
#
# end of FAT Filesystem support

#
# FreeRTOS
#

#
# Kernel
#
# end of Kernel

#
# Port
#
# end of Port

