Jason2866/Tasmota/sdkconfig.defaults
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
# end of Heap memory debugging

#
# Log output
#
# CONFIG_LOG_MAXIMUM_LEVEL_ERROR is not set
# end of Log output

#
# LWIP
#

#
# DHCP server
#
# end of DHCP server


#
# TCP
#
# end of TCP

#
# UDP
#
# end of UDP

#
# Checksums
#
# end of Checksums


#
# ICMP
#
# end of ICMP

#
# LWIP RAW API
#
# end of LWIP RAW API

#
# SNTP
#
# end of SNTP

#
# DNS
#
# end of DNS


#
# Hooks
#
# end of Hooks

# end of LWIP

#
# mbedTLS
#
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set

#
# mbedTLS v3.x related
#
# end of mbedTLS v3.x related

#
# Certificate Bundle
#
# end of Certificate Bundle


#
# Symmetric Ciphers
#
# end of Symmetric Ciphers


#
# Certificates
#
# end of Certificates

# end of mbedTLS

#
# ESP-MQTT Configurations
#
# end of ESP-MQTT Configurations

#
# Newlib
#
# end of Newlib


#
# NVS
#
# end of NVS

#
# OpenThread
#

#
# Thread Operational Dataset
#
# end of Thread Operational Dataset


#
# Thread Address Query Config
#
# end of Thread Address Query Config
# end of OpenThread

#
# Protocomm
#
# end of Protocomm

#
# PThreads
#
# end of PThreads

#
# MMU Config
#
# end of MMU Config

#
# Main Flash configuration
#

#
# SPI Flash behavior when brownout
#
# end of SPI Flash behavior when brownout

#
# Optional and Experimental Features (READ DOCS FIRST)
#

#
# Features here require specific hardware (READ DOCS FIRST!)
#
# end of Optional and Experimental Features (READ DOCS FIRST)
# end of Main Flash configuration

#
# SPI Flash driver
#

#
# Auto-detect flash chips
#
# end of Auto-detect flash chips

# end of SPI Flash driver

#
# TCP Transport
#

#
# Websocket
#
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
# end of Unity unit testing library

#
# Virtual file system
#

#
# Host File System I/O (Semihosting)
#
# end of Host File System I/O (Semihosting)
# end of Virtual file system

#
# Wear Levelling
#
# end of Wear Levelling

#
# DSP Library
#
# end of DSP Library

#
# Camera configuration
#
# end of Camera configuration

#
# esp-modem
#
# end of esp-modem

#
# mDNS
#

#
# MDNS Predefined interfaces
#
# end of MDNS Predefined interfaces
# end of mDNS

#
# LittleFS
#
# CONFIG_LITTLEFS_DISK_VERSION_MOST_RECENT is not set
# CONFIG_LITTLEFS_DISK_VERSION_2_1 is not set
CONFIG_LITTLEFS_DISK_VERSION_2_0=y
# end of LittleFS
# end of Component config


https://raw.githubusercontent.com/Jason2866/dummy/refs/heads/main/tasmota_sdkconfig_esp32
